In [2]:
import numpy as np
import pandas as pd

In [3]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df.head()

                   A         B         C         D
2013-01-01  0.209431 -2.205177  0.403531  0.270569
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106
2013-01-03  1.532839 -0.143431 -0.425497  0.291633
2013-01-04 -0.591369 -0.027161  0.664017 -0.568561
2013-01-05 -1.724054 -0.359603  2.220813  0.685946

In [4]:
df.tail()

                   A         B         C         D
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106
2013-01-03  1.532839 -0.143431 -0.425497  0.291633
2013-01-04 -0.591369 -0.027161  0.664017 -0.568561
2013-01-05 -1.724054 -0.359603  2.220813  0.685946
2013-01-06 -1.544978 -0.353072 -0.301835  0.456821

In [5]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.399274 -0.526642  0.203708  0.136550
std    1.201914  0.834156  1.212541  0.479459
min   -1.724054 -2.205177 -1.338782 -0.568561
25%   -1.306576 -0.357970 -0.394582 -0.170187
50%   -0.434440 -0.248252  0.050848  0.281101
75%    0.087696 -0.089412  0.598896  0.415524
max    1.532839 -0.027161  2.220813  0.685946

In [6]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [9]:
df.to_numpy()

array([[ 0.20943109, -2.20517729,  0.4035314 ,  0.2705687 ],
       [-0.27751105, -0.0714059 , -1.33878248, -0.31710586],
       [ 1.53283922, -0.14343073, -0.4254975 ,  0.29163318],
       [-0.59136911, -0.02716103,  0.66401745, -0.56856061],
       [-1.72405398, -0.35960277,  2.22081257,  0.68594613],
       [-1.54497803, -0.35307228, -0.30183455,  0.45682128]])

In [10]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.209431   -0.277511    1.532839   -0.591369   -1.724054   -1.544978
B   -2.205177   -0.071406   -0.143431   -0.027161   -0.359603   -0.353072
C    0.403531   -1.338782   -0.425497    0.664017    2.220813   -0.301835
D    0.270569   -0.317106    0.291633   -0.568561    0.685946    0.456821

In [11]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06 -1.544978 -0.353072 -0.301835  0.456821
2013-01-05 -1.724054 -0.359603  2.220813  0.685946
2013-01-04 -0.591369 -0.027161  0.664017 -0.568561
2013-01-03  1.532839 -0.143431 -0.425497  0.291633
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106
2013-01-01  0.209431 -2.205177  0.403531  0.270569

In [12]:
df.sort_values(by='A', ascending=False)

                   A         B         C         D
2013-01-03  1.532839 -0.143431 -0.425497  0.291633
2013-01-01  0.209431 -2.205177  0.403531  0.270569
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106
2013-01-04 -0.591369 -0.027161  0.664017 -0.568561
2013-01-06 -1.544978 -0.353072 -0.301835  0.456821
2013-01-05 -1.724054 -0.359603  2.220813  0.685946

In [13]:
a = df.A #output is series
a

2013-01-01    0.209431
2013-01-02   -0.277511
2013-01-03    1.532839
2013-01-04   -0.591369
2013-01-05   -1.724054
2013-01-06   -1.544978
Freq: D, Name: A, dtype: float64

In [14]:
b=df['A'] #output is series
print(b)
print(b.dtypes)

2013-01-01    0.209431
2013-01-02   -0.277511
2013-01-03    1.532839
2013-01-04   -0.591369
2013-01-05   -1.724054
2013-01-06   -1.544978
Freq: D, Name: A, dtype: float64
float64

In [15]:
df[['A','B']] #output dataframe

                   A         B
2013-01-01  0.209431 -2.205177
2013-01-02 -0.277511 -0.071406
2013-01-03  1.532839 -0.143431
2013-01-04 -0.591369 -0.027161
2013-01-05 -1.724054 -0.359603
2013-01-06 -1.544978 -0.353072

In [16]:
df[0:3]  #slices rows

                   A         B         C         D
2013-01-01  0.209431 -2.205177  0.403531  0.270569
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106
2013-01-03  1.532839 -0.143431 -0.425497  0.291633

In [17]:
df['2013-01-01':'2013-01-03'] #using index

                   A         B         C         D
2013-01-01  0.209431 -2.205177  0.403531  0.270569
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106
2013-01-03  1.532839 -0.143431 -0.425497  0.291633

Selection by Label/column

In [18]:
df.loc[:, 'A']  #slices all the rows and given column

2013-01-01    0.209431
2013-01-02   -0.277511
2013-01-03    1.532839
2013-01-04   -0.591369
2013-01-05   -1.724054
2013-01-06   -1.544978
Freq: D, Name: A, dtype: float64

In [19]:
df.loc[:, ['A','B']]

                   A         B
2013-01-01  0.209431 -2.205177
2013-01-02 -0.277511 -0.071406
2013-01-03  1.532839 -0.143431
2013-01-04 -0.591369 -0.027161
2013-01-05 -1.724054 -0.359603
2013-01-06 -1.544978 -0.353072

In [73]:
df.at[:,'A'] #faster than above methods but it is not working - It gives cell value and takes input of cell address in form of name

NameError: name 'index' is not defined

Select via the position of the passed integers:

In [20]:
df.iloc[3]  #3rd row with all the column

A   -0.591369
B   -0.027161
C    0.664017
D   -0.568561
Name: 2013-01-04 00:00:00, dtype: float64

In [21]:
df.iloc[0:3]

                   A         B         C         D
2013-01-01  0.209431 -2.205177  0.403531  0.270569
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106
2013-01-03  1.532839 -0.143431 -0.425497  0.291633

In [22]:
df.iloc[0:3, 0:2]

                   A         B
2013-01-01  0.209431 -2.205177
2013-01-02 -0.277511 -0.071406
2013-01-03  1.532839 -0.143431

In [23]:
df.iloc[[0,1,2,3], [0,1,2]]

                   A         B         C
2013-01-01  0.209431 -2.205177  0.403531
2013-01-02 -0.277511 -0.071406 -1.338782
2013-01-03  1.532839 -0.143431 -0.425497
2013-01-04 -0.591369 -0.027161  0.664017

In [24]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106
2013-01-03  1.532839 -0.143431 -0.425497  0.291633

In [26]:
df.iat[1,3] #fast access to tabular data

-0.3171058552013116

In [27]:
#Using a single columnâ€™s values to select data.
df[df.A>0]

                   A         B         C         D
2013-01-01  0.209431 -2.205177  0.403531  0.270569
2013-01-03  1.532839 -0.143431 -0.425497  0.291633

In [28]:
#Selecting values from a DataFrame where a boolean condition is met.
df[df>0]

                   A   B         C         D
2013-01-01  0.209431 NaN  0.403531  0.270569
2013-01-02       NaN NaN       NaN       NaN
2013-01-03  1.532839 NaN       NaN  0.291633
2013-01-04       NaN NaN  0.664017       NaN
2013-01-05       NaN NaN  2.220813  0.685946
2013-01-06       NaN NaN       NaN  0.456821

In [29]:
df1 = df.copy()

In [30]:
df1['E']=['one','one','two','three','four','three']
df1

                   A         B         C         D      E
2013-01-01  0.209431 -2.205177  0.403531  0.270569    one
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106    one
2013-01-03  1.532839 -0.143431 -0.425497  0.291633    two
2013-01-04 -0.591369 -0.027161  0.664017 -0.568561  three
2013-01-05 -1.724054 -0.359603  2.220813  0.685946   four
2013-01-06 -1.544978 -0.353072 -0.301835  0.456821  three

In [31]:
df1[df1['E'].isin(['two','four'])] #check if columns are available in data frame

                   A         B         C         D     E
2013-01-03  1.532839 -0.143431 -0.425497  0.291633   two
2013-01-05 -1.724054 -0.359603  2.220813  0.685946  four

VLOOKUP - Setting a new column automatically aligns the data by the indexes
Note:- Index should be set unique ID in both the Data Frames

In [32]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [33]:
df1['F'] = s1
df1

                   A         B         C         D      E    F
2013-01-01  0.209431 -2.205177  0.403531  0.270569    one  NaN
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106    one  1.0
2013-01-03  1.532839 -0.143431 -0.425497  0.291633    two  2.0
2013-01-04 -0.591369 -0.027161  0.664017 -0.568561  three  3.0
2013-01-05 -1.724054 -0.359603  2.220813  0.685946   four  4.0
2013-01-06 -1.544978 -0.353072 -0.301835  0.456821  three  5.0

Setting value of cell by position

In [34]:
df1.iat[0,1] = 0
df1

                   A         B         C         D      E    F
2013-01-01  0.209431  0.000000  0.403531  0.270569    one  NaN
2013-01-02 -0.277511 -0.071406 -1.338782 -0.317106    one  1.0
2013-01-03  1.532839 -0.143431 -0.425497  0.291633    two  2.0
2013-01-04 -0.591369 -0.027161  0.664017 -0.568561  three  3.0
2013-01-05 -1.724054 -0.359603  2.220813  0.685946   four  4.0
2013-01-06 -1.544978 -0.353072 -0.301835  0.456821  three  5.0

In [35]:
#Setting by assigning with a NumPy array:
df1['D'] = np.array([5]*len(df))
df1

                   A         B         C  D      E    F
2013-01-01  0.209431  0.000000  0.403531  5    one  NaN
2013-01-02 -0.277511 -0.071406 -1.338782  5    one  1.0
2013-01-03  1.532839 -0.143431 -0.425497  5    two  2.0
2013-01-04 -0.591369 -0.027161  0.664017  5  three  3.0
2013-01-05 -1.724054 -0.359603  2.220813  5   four  4.0
2013-01-06 -1.544978 -0.353072 -0.301835  5  three  5.0

In [41]:
#A where operation with setting
df2 = df1.copy()
df2 = df2.iloc[: , 0:4]
df2[df2>0] = -df2 #should have only numerical variables, it will be applied

In [42]:
df2

                   A         B         C  D
2013-01-01 -0.209431  0.000000 -0.403531 -5
2013-01-02 -0.277511 -0.071406 -1.338782 -5
2013-01-03 -1.532839 -0.143431 -0.425497 -5
2013-01-04 -0.591369 -0.027161 -0.664017 -5
2013-01-05 -1.724054 -0.359603 -2.220813 -5
2013-01-06 -1.544978 -0.353072 -0.301835 -5

In [43]:
l1 = [0,1,2,3,4,5]
t1 = (1,3,5,7,9,11)
s1 = pd.Series([2,4,6,8,10,12])

In [46]:
df3 = pd.DataFrame(data=[l1,t1,s1], columns = ['A','B','C','D','E','F'], index = pd.date_range('20190501', periods=3))

In [47]:
df3

            A  B  C  D   E   F
2019-05-01  0  1  2  3   4   5
2019-05-02  1  3  5  7   9  11
2019-05-03  2  4  6  8  10  12

In [66]:
df4 = pd.DataFrame(np.random.randint(5,size=(3,5)), columns = ['A','B','C','D','E'], index = pd.date_range('20190504', periods=3))

In [67]:
df4

            A  B  C  D  E
2019-05-04  2  0  3  1  1
2019-05-05  1  1  4  0  0
2019-05-06  2  2  2  2  3

In [68]:
df3.align(df4, join='outer', axis=1) #it returns tuple of combined data frames

(            A  B  C  D   E   F
 2019-05-01  0  1  2  3   4   5
 2019-05-02  1  3  5  7   9  11
 2019-05-03  2  4  6  8  10  12,             A  B  C  D  E   F
 2019-05-04  2  0  3  1  1 NaN
 2019-05-05  1  1  4  0  0 NaN
 2019-05-06  2  2  2  2  3 NaN)

In [69]:
df6 = pd.concat([df3,df4])
df6

C:\Users\ManagingDirector\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

            A  B  C  D   E     F
2019-05-01  0  1  2  3   4   5.0
2019-05-02  1  3  5  7   9  11.0
2019-05-03  2  4  6  8  10  12.0
2019-05-04  2  0  3  1   1   NaN
2019-05-05  1  1  4  0   0   NaN
2019-05-06  2  2  2  2   3   NaN

In [76]:
df6['F'].fillna(method = 'ffill') #1)ffil, bfill, nearest or interpolate
df6

            A  B  C  D   E     F
2019-05-01  0  1  2  3   4   5.0
2019-05-02  1  3  5  7   9  11.0
2019-05-03  2  4  6  8  10  12.0
2019-05-04  2  0  3  1   1   NaN
2019-05-05  1  1  4  0   0   NaN
2019-05-06  2  2  2  2   3   NaN

In [92]:
#drop labels by axis
df6 = df6.drop(['F'], axis=1) # column drop

In [103]:
df6 = df6.drop(['2019-05-02', '2019-05-06'],axis=0) # row drop

KeyError: "['2019-05-02' '2019-05-06'] not found in axis"

In [102]:
df6

            A  B  C  D   E
2019-05-01  0  1  2  3   4
2019-05-02  1  3  5  7   9
2019-05-03  2  4  6  8  10
2019-05-04  2  0  3  1   1
2019-05-05  1  1  4  0   0
2019-05-06  2  2  2  2   3

In [118]:
df6 = df6.rename({'A':'one','B':'two'}, axis = 1) #or axis = 'columns'
df6

            one  two  C  D   E
2019-05-01    0    1  2  3   4
2019-05-02    1    3  5  7   9
2019-05-03    2    4  6  8  10
2019-05-04    2    0  3  1   1
2019-05-05    1    1  4  0   0
2019-05-06    2    2  2  2   3

In [125]:
df6 = df6.rename({'2019-05-01':'one','2019-05-02':'two'}, axis = 0) #or axis = 'index'
df6

            one  two  C  D   E
2019-05-01    0    1  2  3   4
2019-05-02    1    3  5  7   9
2019-05-03    2    4  6  8  10
2019-05-04    2    0  3  1   1
2019-05-05    1    1  4  0   0
2019-05-06    2    2  2  2   3

In [126]:
#iteration over data frame works on columns
for col in df6:
    print(col)

one
two
C
D
E

In [129]:
#interation over dataframe rows
for i in df6.iterrows():
    print(i)

(Timestamp('2019-05-01 00:00:00'), one    0
two    1
C      2
D      3
E      4
Name: 2019-05-01 00:00:00, dtype: int64)
(Timestamp('2019-05-02 00:00:00'), one    1
two    3
C      5
D      7
E      9
Name: 2019-05-02 00:00:00, dtype: int64)
(Timestamp('2019-05-03 00:00:00'), one     2
two     4
C       6
D       8
E      10
Name: 2019-05-03 00:00:00, dtype: int64)
(Timestamp('2019-05-04 00:00:00'), one    2
two    0
C      3
D      1
E      1
Name: 2019-05-04 00:00:00, dtype: int64)
(Timestamp('2019-05-05 00:00:00'), one    1
two    1
C      4
D      0
E      0
Name: 2019-05-05 00:00:00, dtype: int64)
(Timestamp('2019-05-06 00:00:00'), one    2
two    2
C      2
D      2
E      3
Name: 2019-05-06 00:00:00, dtype: int64)

In [131]:
#Topreservedtypeswhileiteratingovertherows,itisbettertouse itertuples() whichreturnsnamedtuplesofthe values and which is generally much faster than iterrows().
for i in df6.itertuples():
    print(i)

Pandas(Index=Timestamp('2019-05-01 00:00:00'), one=0, two=1, C=2, D=3, E=4)
Pandas(Index=Timestamp('2019-05-02 00:00:00'), one=1, two=3, C=5, D=7, E=9)
Pandas(Index=Timestamp('2019-05-03 00:00:00'), one=2, two=4, C=6, D=8, E=10)
Pandas(Index=Timestamp('2019-05-04 00:00:00'), one=2, two=0, C=3, D=1, E=1)
Pandas(Index=Timestamp('2019-05-05 00:00:00'), one=1, two=1, C=4, D=0, E=0)
Pandas(Index=Timestamp('2019-05-06 00:00:00'), one=2, two=2, C=2, D=2, E=3)

In [137]:
# .dt accessor allows us to pick date, hour, mint and second from timestamp
s = pd.Series(pd.date_range('20190506 12:30:15', periods=3))
s

0   2019-05-06 12:30:15
1   2019-05-07 12:30:15
2   2019-05-08 12:30:15
dtype: datetime64[ns]

In [133]:
s.dt.date

0    2019-05-06
1    2019-05-07
2    2019-05-08
3    2019-05-09
4    2019-05-10
dtype: object

In [134]:
s.dt.hour

0    12
1    12
2    12
3    12
4    12
dtype: int64

In [135]:
s.dt.minute

0    30
1    30
2    30
3    30
4    30
dtype: int64

In [136]:
s.dt.second

0    15
1    15
2    15
3    15
4    15
dtype: int64

In [140]:
df7 = pd.DataFrame(data=[l1,t1,s1],columns = ['a1','a2','a3','a4','a5','a6'])
df7

   a1  a2  a3  a4  a5  a6
0   0   1   2   3   4   5
1   1   3   5   7   9  11
2   2   4   6   8  10  12

In [141]:
df7['a7'] = s
df7

   a1  a2  a3  a4  a5  a6                  a7
0   0   1   2   3   4   5 2019-05-06 12:30:15
1   1   3   5   7   9  11 2019-05-07 12:30:15
2   2   4   6   8  10  12 2019-05-08 12:30:15

In [145]:
df7['date'] = df7['a7'].dt.date
df7['interval'] = df7['a7'].dt.hour
df7['day'] = df7['a7'].dt.day
df7

   a1  a2  a3  a4  a5  a6                  a7        date  interval  day
0   0   1   2   3   4   5 2019-05-06 12:30:15  2019-05-06        12    6
1   1   3   5   7   9  11 2019-05-07 12:30:15  2019-05-07        12    7
2   2   4   6   8  10  12 2019-05-08 12:30:15  2019-05-08        12    8

In [163]:
df7.dtypes

a1                   int64
a2                   int64
a3                   int64
a4                   int64
a5                   int64
a6                   int64
a7          datetime64[ns]
date                object
interval             int64
day                  int64
dtype: object

In [166]:
#Object conversion to dtype
df7['date'] = pd.to_datetime(df7['date'])

In [167]:
df7.dtypes

a1                   int64
a2                   int64
a3                   int64
a4                   int64
a5                   int64
a6                   int64
a7          datetime64[ns]
date        datetime64[ns]
interval             int64
day                  int64
dtype: object

In [151]:
df7['a7'].dt.strftime('%Y/%m/%d')

0    2019/05/06
1    2019/05/07
2    2019/05/08
Name: a7, dtype: object

In [159]:
s = pd.Series(np.random.permutation(10))
s

0    3
1    4
2    8
3    0
4    6
5    9
6    1
7    2
8    5
9    7
dtype: int32

In [160]:
s.sort_values()

3    0
6    1
7    2
0    3
1    4
8    5
4    6
9    7
2    8
5    9
dtype: int32

In [161]:
s.nsmallest(5)

3    0
6    1
7    2
0    3
1    4
dtype: int32

In [162]:
s.nlargest(5)

5    9
2    8
9    7
4    6
8    5
dtype: int32

In [169]:
del df7['a6']
df7

   a1  a2  a3  a4  a5                  a7       date  interval  day
0   0   1   2   3   4 2019-05-06 12:30:15 2019-05-06        12    6
1   1   3   5   7   9 2019-05-07 12:30:15 2019-05-07        12    7
2   2   4   6   8  10 2019-05-08 12:30:15 2019-05-08        12    8

In [170]:
df7['a6'] = '3'
df7

   a1  a2  a3  a4  a5                  a7       date  interval  day a6
0   0   1   2   3   4 2019-05-06 12:30:15 2019-05-06        12    6  3
1   1   3   5   7   9 2019-05-07 12:30:15 2019-05-07        12    7  3
2   2   4   6   8  10 2019-05-08 12:30:15 2019-05-08        12    8  3

In [180]:
np.random.randn(3,5)

array([[ 1.18727644,  0.63302547, -0.0415275 , -0.23668533, -0.73631173],
       [-1.47053964, -1.80169485,  1.80640116,  1.06513102,  0.09590569],
       [ 0.31481774,  0.0190635 , -0.08400668,  0.53723721,  0.62994964]])

In [199]:
df8 = pd.DataFrame(np.random.randint(3,9, size=(10,5)), columns = ['q1','q2','q3','q4','q5'])
df8

   q1  q2  q3  q4  q5
0   6   7   3   7   7
1   8   7   3   6   4
2   7   6   8   4   3
3   8   6   5   3   6
4   4   7   6   8   3
5   5   6   5   3   3
6   8   4   5   7   5
7   8   8   3   5   7
8   3   5   7   5   5
9   7   6   7   7   7

In [204]:
df8.iloc[:5 , 0:2] #by position

   q1  q2
0   6   7
1   8   7
2   7   6
3   8   6
4   4   7

In [208]:
df8.loc[: , ['q1','q5']] # by label

   q1  q5
0   6   7
1   8   4
2   7   3
3   8   6
4   4   3
5   5   3
6   8   5
7   8   7
8   3   5
9   7   7

In [210]:
df8['prod'] = np.nan

In [211]:
df8

   q1  q2  q3  q4  q5  prod
0   6   7   3   7   7   NaN
1   8   7   3   6   4   NaN
2   7   6   8   4   3   NaN
3   8   6   5   3   6   NaN
4   4   7   6   8   3   NaN
5   5   6   5   3   3   NaN
6   8   4   5   7   5   NaN
7   8   8   3   5   7   NaN
8   3   5   7   5   5   NaN
9   7   6   7   7   7   NaN

for i in df8:
    if df8['q5']<7:
        df['prod'].append('CC')
    else:
        df['prod'].append('DC')
df8

In [224]:
l = ['cc','cc','cc','cc','cc','DC','DC','DC','DC','DC']
df8['prod'] = l
df8

   q1  q2  q3  q4  q5 prod
0   6   7   3   7   7   cc
1   8   7   3   6   4   cc
2   7   6   8   4   3   cc
3   8   6   5   3   6   cc
4   4   7   6   8   3   cc
5   5   6   5   3   3   DC
6   8   4   5   7   5   DC
7   8   8   3   5   7   DC
8   3   5   7   5   5   DC
9   7   6   7   7   7   DC

In [248]:
pd.pivot_table(df8, values = ['q1','q2','q3','q4','q5'], columns = 'prod', aggfunc=np.sum) #default aggfunc is mean

prod  DC  cc
q1    31  33
q2    29  33
q3    27  25
q4    27  28
q5    27  23

In [238]:
df8.groupby(by = 'prod').sum().T

prod  DC  cc
q1    31  33
q2    29  33
q3    27  25
q4    27  28
q5    27  23

In [251]:
pd.pivot_table(df8, values = ['q1','q2','q3','q4','q5'], columns = ['prod']).count()

prod
DC    5
cc    5
dtype: int64

In [243]:
df8.groupby(by = 'prod').count()

      q1  q2  q3  q4  q5
prod
DC     5   5   5   5   5
cc     5   5   5   5   5

In [256]:
pd.crosstab(df8.q1, df8.q2)

q2  4  5  6  7  8
q1
3   0  1  0  0  0
4   0  0  0  1  0
5   0  0  1  0  0
6   0  0  0  1  0
7   0  0  2  0  0
8   1  0  1  1  1

In [259]:
pd.crosstab(df8.q1, df8['prod'], values = df8.q3, aggfunc=np.sum)

prod   DC   cc
q1
3     7.0  NaN
4     NaN  6.0
5     5.0  NaN
6     NaN  3.0
7     7.0  8.0
8     8.0  8.0

In [260]:
pd.get_dummies(df8['prod'])

   DC  cc
0   0   1
1   0   1
2   0   1
3   0   1
4   0   1
5   1   0
6   1   0
7   1   0
8   1   0
9   1   0

In [261]:
pd.get_dummies(df8)

   q1  q2  q3  q4  q5  prod_DC  prod_cc
0   6   7   3   7   7        0        1
1   8   7   3   6   4        0        1
2   7   6   8   4   3        0        1
3   8   6   5   3   6        0        1
4   4   7   6   8   3        0        1
5   5   6   5   3   3        1        0
6   8   4   5   7   5        1        0
7   8   8   3   5   7        1        0
8   3   5   7   5   5        1        0
9   7   6   7   7   7        1        0

In [266]:
df8.agg(['sum','mean','max','count','std','var'])

,q1,q2,q3,q4,q5,prod
sum,64.000000,62.000000,52.000000,55.000000,50.000000,ccccccccccDCDCDCDCDC
mean,6.400000,6.200000,5.200000,5.500000,5.000000,NaN
max,8.000000,8.000000,8.000000,8.000000,7.000000,cc
count,10.000000,10.000000,10.000000,10.000000,10.000000,10
std,1.837873,1.135292,1.813529,1.779513,1.699673,NaN
var,3.377778,1.288889,3.288889,3.166667,2.888889,NaN